In [1]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder
from sklearn.naive_bayes import MultinomialNB as MB
from sklearn.metrics import confusion_matrix
import numpy as np
from sklearn.naive_bayes import GaussianNB

In [2]:
df_train=pd.read_csv("SalaryData_Train.csv")

In [3]:
df_test=pd.read_csv("SalaryData_Test.csv")

In [4]:
df_train.head()

,age,workclass,education,educationno,maritalstatus,occupation,relationship,race,sex,capitalgain,capitalloss,hoursperweek,native,Salary
0,39,State-gov,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [5]:
string_col = ["workclass","education","maritalstatus","occupation","relationship","race","sex","native"]

In [6]:
labelencoder = LabelEncoder()

In [7]:
for i in string_col:
    df_train[i]= labelencoder.fit_transform(df_train[i])
    df_test[i]=labelencoder.fit_transform(df_test[i])

In [8]:
df_train.head()

,age,workclass,education,educationno,maritalstatus,occupation,relationship,race,sex,capitalgain,capitalloss,hoursperweek,native,Salary
0,39,5,9,13,4,0,1,4,1,2174,0,40,37,<=50K
1,50,4,9,13,2,3,0,4,1,0,0,13,37,<=50K
2,38,2,11,9,0,5,1,4,1,0,0,40,37,<=50K
3,53,2,1,7,2,5,0,2,1,0,0,40,37,<=50K
4,28,2,9,13,2,9,5,2,0,0,0,40,4,<=50K

In [9]:
mapping = {' >50K': 1, ' <=50K': 2}

In [10]:
df_train = df_train.replace({'Salary': mapping})
df_test = df_test.replace({'Salary': mapping})

In [11]:
df_train.head()

,age,workclass,education,educationno,maritalstatus,occupation,relationship,race,sex,capitalgain,capitalloss,hoursperweek,native,Salary
0,39,5,9,13,4,0,1,4,1,2174,0,40,37,2
1,50,4,9,13,2,3,0,4,1,0,0,13,37,2
2,38,2,11,9,0,5,1,4,1,0,0,40,37,2
3,53,2,1,7,2,5,0,2,1,0,0,40,37,2
4,28,2,9,13,2,9,5,2,0,0,0,40,4,2

In [12]:
x_train = df_train.iloc[:,0:13]
y_train = df_train.iloc[:,13]
x_test = df_test.iloc[:,0:13]
y_test = df_test.iloc[:,13]

# Gaussian Naive Bayes

In [13]:
classifier_gb = GaussianNB()
classifier_gb.fit(x_train,y_train)

GaussianNB()

In [14]:
y_pred_gb=classifier_gb.predict(x_test)

In [15]:
cm=confusion_matrix(y_test,y_pred_gb)
cm

array([[ 1209,  2491],
       [  601, 10759]], dtype=int64)

In [16]:
print ("Accuracy",np.mean(y_pred_gb==y_test.values.flatten()))

Accuracy 0.7946879150066402

# Multinomial Naive Bayes

In [17]:
classifier_mb = MB()
classifier_mb.fit(x_train,y_train)

MultinomialNB()

In [18]:
y_pred_mb=classifier_mb.predict(x_test)

In [19]:
cm=confusion_matrix(y_test,y_pred_mb)
cm

array([[  780,  2920],
       [  469, 10891]], dtype=int64)

In [20]:
print ("Accuracy",np.mean(y_pred_mb==y_test.values.flatten()))

Accuracy 0.7749667994687915

## when we comparing to multinomial and gaussian naive bayes. We got more accuracy in gaussian naive bayes than multinomial naive bayes.